src/cf/Catalogs/НастройкиПодключенияRMQ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>НастройкиПодключенияRMQ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВиртуальныйХост</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОчереди</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/ОбщийМодульRMQВызовСервера/Ext/Module.bsl
#Область СлужебныеПроцедуры

Функция ПолучитьОбщийМакетRMQ() Экспорт
	
	МакетВнешнейКомпоненты = ПолучитьОбщийМакет("ВнешняяКомпонентаRMQ");
		
	Возврат МакетВнешнейКомпоненты;
	
КонецФункции 

Функция ПараметрыПодключения(НастройкиПодключенияRMQ) Экспорт
	
	Если ТипЗнч(НастройкиПодключенияRMQ) = Тип("Строка") Тогда
		НастройкиПодключенияRMQ = Справочники.НастройкиПодключенияRMQ.НайтиПоНаименованию(НастройкиПодключенияRMQ); 
	КонецЕсли;
	
	Параметры =  Новый Структура;
	
	Параметры.Вставить("Адрес",НастройкиПодключенияRMQ.Адрес);
	Параметры.Вставить("Порт", НастройкиПодключенияRMQ.Порт);
	Параметры.Вставить("Логин", НастройкиПодключенияRMQ.Логин);
	Параметры.Вставить("Пароль", НастройкиПодключенияRMQ.Пароль);
	Параметры.Вставить("ВиртуальныйХост", НастройкиПодключенияRMQ.ВиртуальныйХост);
	Параметры.Вставить("ИмяОчереди", НастройкиПодключенияRMQ.ИмяОчереди);
	Параметры.Вставить("ТочкаОбмена", НастройкиПодключенияRMQ.ТочкаОбмена);
	
	Возврат Параметры;
	
КонецФункции

Процедура ДобавитьВходящееСообщение(ОтветноеСообщение) Экспорт
	
	РегистрыСведений.ОчередьВходящихСообщений.ДобавитьСообщение(ОтветноеСообщение);
	
КонецПроцедуры	
#КонецОбласти
